[

    {
        "title":"วัคซีนชนิดสารพันธุกรรม",
        "subtitle":"วัคซีนกลุ่มนี้ ใช้เทคโนโลยีใหม่สังเคราะห์สารพันธุกรรมเอ็มอาร์เอ็นเอ (messenger RNA: mRNA) ที่เฉพาะเจาะจงกับเชื้อไวรัส",
        "subtitle2":"ได้แก่ วัคซีนของบริษัท Pfizer และ Moderna",
        "imageURL":"https://raw.githubusercontent.com/boomnicekab/BasicAPI/main/P1.jpg",
        "detail":"mRNA (messenger Ribonucleic Acid) เป็นสารพันธุกรรมที่อยู่ในเซลล์ของร่างกายทำหน้าที่ออกคำสั่งให้เซลล์ผลิตโปรตีนขึ้นตามรหัสคำสั่งนั้น ๆ เป็นกลไกปกติของร่างกาย หลักการทำงานของวัคซีนป้องกันโรคโควิด-19 ชนิด mRNA คือการเอาชิ้นส่วนสารพันธุกรรมของเชื้อโควิด- 19 (mRNA) ส่วนที่เกี่ยวข้องกับการสร้างโปรตีนส่วนที่เป็นปุ่มหนามของเชื้อไวรัส (Spike protein) นำมาสังเคราะห์เป็นรหัสคำสั่งที่เรียกว่า S-spike mRNA เมื่อฉีดวัคซีนชนิด mRNA เข้าสู่ร่างกายจะทำให้เซลล์ในร่างกายผลิตโปรตีนส่วนที่เป็นปุ่มหนามของไวรัสขึ้น และโปรตีนที่ผลิตในส่วนนี้เองจะทำหน้าที่เป็นตัวกระตุ้นภูมิคุ้มกัน (Antigen) ให้ร่างกายรู้จักกับเชื้อโรคโควิด-19 และสร้างภูมิคุ้มกัน (Antibody)เพื่อป้องกันการเจ็บป่วยหรือเสียชีวิตจากโรคโควิด-19 โดยธรรมชาติ สารพันธุกรรม mRNA เหล่านี้จะถูกขจัดออกจากร่างกายภายในระยะเวลาไม่นาน จึงไม่สะสมหรือฝังตัวอยู่ในนิวเคลียสของเซลล์ในร่างกายตามที่มีการเผยแพร่ในสื่อสังคมออนไลน์"
        
    },
    {
        "title":"วัคซีนชนิดใช้ไวรัสเป็นพาหะ",
        "subtitle":"วัคซีนกลุ่มนี้ใช้ไวรัสที่สามารถตัดแต่งพันธุกรรม และใส่สารพันธุกรรมของไวรัสโรคโควิด19 ติดไปด้วย",
        "subtitle2":"ได้แก่ วัคซีนโดยบริษัท Astra Zeneca, วัคซีนโดยบริษัท CanSinoBio , วัคซีนโดยบริษัท Johnson and Johnson และ วัคซีนโดยบริษัท Gamaleya",
        "imageURL":"https://raw.githubusercontent.com/boomnicekab/BasicAPI/main/P2.jpg",
        "detail":"Recombinant viral vector vaccine วัคซีนกลุ่มนี้ใช้ ไวรัสที่สามารถตัดแต่งพันธุกรรม เช่น ไวรัสอะดีโน (Adenovirus) โดยน ามาดัดแปลงพันธุกรรมให้ไม่สามารถ แบ่งตัวได้ และใส่สารพันธุกรรมของไวรัสโรคโควิด19 ติดไปด้วย เมื่อน ามาฉีดไวรัสพาหะเหล่านี้จะเลียนแบบการติดเชื้อตามธรรมชาติ โดยกระตุ้มภูมิคุ้มกันทั้งระบบให้สร้างแอนติบอดีต่อไวรัสโรคโควิด19 ตามสารพันธุกรรมที่ใส่เข้าไป อย่างไรก็ตามแม้ว่าจะเป็นวัคซีนที่ไวรัสอะดีโนไม่แบ่งตัว แต่ยังจัดเป็นไวรัสที่มีชีวิตเมื่อเข้าสู่ร่างกาย จึงยังไม่แนะนำให้ใช้ในผู้ที่มีภูมิคุ้มกันบกพร่องอย่างมาก จนกว่าจะมีข้อมูลที่ชัดเจนมากกว่านี้ ปัจจุบันวัคซีนชนิดนี้ที่ใช้กันแพร่หลายมี 4 แบรนด์ ได้แก่ ไวรัสอะดีโนของชิมแพนซี (Chimpanzee adenovirus) โดยบริษัท Astra Zeneca มีประสิทธิภาพป้องกันอาการประมาณ 70-80% ป้องกันการเสียชีวิตได้ 100% ไวรัสอะดีโนของมนุษย์สายพันธุ์ 5 (Human adenovirus type 5) โดยบริษัท CanSinoBio มีประสิทธิภาพป้องกันอาการประมาณ 60%"
        
    },
    {
        "title":"วัคซีนที่ทําจากโปรตีนส่วนหนึ่งของเชื้อ",
        "subtitle":"ผลิตโดยการ สร้างโปรตีนของเชื้อไวรัส แล้วนํามาผสมกับสารกระตุ้นภูมิ เมื่อฉีดเข้าสู่ร่างกายจะกระตุ้นให้ร่างกายสร้างแอนตีบอดีต่อต้านโปรตีนสไปค์ของไวรัสโรคโควิด19 ",
        "subtitle2":"ได้แก่ วัคซีนแบรนด์ Novavax ซึ่งผลิตจาก baculovirus",
        "imageURL":"https://raw.githubusercontent.com/boomnicekab/BasicAPI/main/P3.jpg",
        "detail":"Protein subunit vaccine เป็นวัคซีนที่เลียนแบบสไปรท์​โปรตีน หรือหนามแหลมของไวรัส โดยอาศัยสื่งมีชีวิตอื่นสร้างขึ้นมา เช่น แบคทีเรีย ยีสต์ หรือพืช วัคซีนที่ผลิตโดยเทคโนโลยีนี้ ทั่วโลกมีความคุ้นเคยมานาน เพราะใช้ในการผลิตวัคซีนหลายชนิด เช่น วัคซีนป้องกันไข้หวัดใหญ่ วัคซีนป้องกันไวรัสตับอักเสบบี เป็นต้น ผลิตโดยการ สร้างโปรตีนของเชื้อไวรัส ด้วยระบบ cell culture, yeast, baculovirus เป็นต้น แล้วนํามาผสมกับสารกระตุ้นภูมิ เมื่อฉีดเข้าสู่ร่างกายจะกระตุ้นให้ร่างกายสร้างแอนตีบอดีต่อต้านโปรตีนสไปค์ของไวรัสโรคโควิด19 วัคซีนที่มีใช้ในปัจจุบันคือ วัคซีนแบรนด์ Novavax ซึ่งผลิตจาก baculovirus และใช้ Matrix M เป็นตัวกระตุ้นภูมิ"
        
    },
    {
        "title":"วัคซีนชนิดเชื้อตาย",
        "subtitle":"วัคซีนกลุ่มนี้ผลิตโดยนําไวรัสโรคโควิด19 มาเลี้ยงขยายจํานวนมาก และนํามาทำให้เชื้อตาย  การฉีดวัคซีนจะกระตุ้นให้ร่างกาย",
        "subtitle2":"ได้แก่ วัคซีนของบริษัท Sinovac",
        "imageURL":"https://raw.githubusercontent.com/boomnicekab/BasicAPI/main/P4.jpg",
        "detail":"Inactivated vaccine วัคซีนกลุ่มนี้ผลิตโดยนําไวรัสโรคโควิด19 มาเลี้ยงขยายจํานวนมาก และนํามาทำให้เเชื้อตาย  การฉีดวัคซีนจะกระตุ้นให้ร่างกายสร้างภูมิคุ้มกันต่อไวรัสทุกส่วน เสมือนได้รับเชื้อไวรัสโดยตรงแต่ไม่ทำให้เกิดโรค เพราะเชื้อตายแล้ว  เทคโนโลยีนี้เป็นวิธีที่ใช้กับวัคซีนตับอักเสบเอ โปลิโอชนิดฉีด จึงมีความคุ้นเคยในประสิทธิภาพและความปลอดภัยมานาน แต่เนื่องจากการเพาะเลี้ยงไวรัสต้องใช้ความระมัดระวังมาก ทําให้ผลิตได้ช้าและมีราคาแพง"
        
    }

]
